# Throughout the exercises for Regression in Python lessons, you will use the following example scenario: 
As a customer analyst, I want to know who has spent the most money with us over their lifetime. I have monthly charges and tenure, so I think I will be able to use those two attributes as features to estimate total_charges. I need to do this within an average of $5.00 per customer.

The first step will be to acquire and prep the data. Do your work for this exercise in a file named wrangle.py.

1. Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.
2. Walk through the steps above using your new dataframe. You may handle the missing values however you feel is appropriate.
3. End with a python file wrangle.py that contains the function, wrangle_telco(), that will acquire the data and return a dataframe cleaned with no missing values.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from env import get_db_url

In [2]:
query = """SELECT customer_id,
tenure,
monthly_charges,
total_charges
FROM customers
WHERE contract_type_id = 3;"""

In [3]:
url = get_db_url("telco_churn")

In [4]:
telco = pd.read_sql(query, url)

In [5]:
#Take a look at the head
telco.head()

  customer_id  tenure  monthly_charges total_charges
0  0013-SMEOE      71           109.70       7904.25
1  0014-BMAQU      63            84.65        5377.8
2  0016-QLJIS      65            90.45        5957.9
3  0017-DINOC      54            45.20       2460.55
4  0017-IUDMW      72           116.80       8456.75

In [6]:
#Take a look at the tail
telco.tail()

     customer_id  tenure  monthly_charges total_charges
1690  9964-WBQDJ      71            24.40        1725.4
1691  9972-EWRJS      67            19.25        1372.9
1692  9975-GPKZU      46            19.75         856.5
1693  9993-LHIEB      67            67.85       4627.65
1694  9995-HOTOH      63            59.00        3707.6

In [7]:
#get a sense of how large the dataset is
telco.shape

(1695, 4)

In [8]:
#look at the datatypes to make sure everything is ok
telco.describe()

            tenure  monthly_charges
count  1695.000000      1695.000000
mean     56.735103        60.770413
std      18.209363        34.678865
min       0.000000        18.400000
25%      48.000000        24.025000
50%      64.000000        64.350000
75%      71.000000        90.450000
max      72.000000       118.750000

total charges should be numerical but is missing

In [9]:
#take a look at the data types
telco.dtypes

customer_id         object
tenure               int64
monthly_charges    float64
total_charges       object
dtype: object

In [10]:
# make sure there are no null's
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
tenure             1695 non-null int64
monthly_charges    1695 non-null float64
total_charges      1695 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [11]:
#take a look at the min and max for total_charges coloumn to see what's going on
telco.total_charges.max()

'987.95'

In [12]:
telco.total_charges.min()

' '

In [13]:
#sine the min is a space we will remove that value and replace with a Nan for now
telco.total_charges = telco.total_charges.str.strip()
telco = telco.replace("", np.nan)

In [14]:
#check the data info again
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
tenure             1695 non-null int64
monthly_charges    1695 non-null float64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [15]:
#drop the nan's since there are only a small amount compared to the data
telco = telco.dropna()

In [16]:
#AND check th data again
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
tenure             1685 non-null int64
monthly_charges    1685 non-null float64
total_charges      1685 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 65.8+ KB

In [17]:
#look at the total_charges to see what the data looks like 
telco.total_charges

0       7904.25
1        5377.8
2        5957.9
3       2460.55
4       8456.75
         ...
1690     1725.4
1691     1372.9
1692      856.5
1693    4627.65
1694     3707.6
Name: total_charges, Length: 1685, dtype: object

In [18]:
#change the type of the colomn to a float
telco.total_charges = telco.total_charges.astype("float")

In [19]:
telco.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1685 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1685 non-null object
tenure             1685 non-null int64
monthly_charges    1685 non-null float64
total_charges      1685 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 65.8+ KB